ci4web/app/Controllers/Mahasiswa.php

    public function index()
    {
        $m = new MahasiswaModel();
        $q = trim($this->request->getGet('q') ?? '');

        if ($q !== '') {
            $rows = $m->like('nama', $q)->orderBy('nim','ASC')->findAll();
        } else {
            $rows = $m->orderBy('nim','ASC')->findAll();
---
SELECT *
FROM `mahasiswa`
WHERE `nama` LIKE '%Asep%' ESCAPE '!'
ORDER BY `nim` ASC
SELECT *
FROM `mahasiswa`
ORDER BY `nim` ASC

    public function detail($nim)
    {
        $row = (new MahasiswaModel())->find($nim);
---
SELECT *
FROM `mahasiswa`
WHERE `mahasiswa`.`nim` = '0000003'

    public function store()
    {
        (new MahasiswaModel())->insert([
            'nim'  => $this->request->getPost('nim'),
            'nama' => $this->request->getPost('nama'),
            'umur' => (int) $this->request->getPost('umur'),
        ]);
---
INSERT INTO `mahasiswa` (`nim`, `nama`, `umur`) VALUES ('0000005', 'Amaw', 20)

    public function edit($nim)
    {
        $row = (new MahasiswaModel())->find($nim);
---
SELECT *
FROM `mahasiswa`
WHERE `mahasiswa`.`nim` = '0000001'

    public function delete($nim)
    {
        (new MahasiswaModel())->delete($nim);
---
DELETE FROM `mahasiswa`
WHERE `nim` IN ('0000005')